app/controllers/api/v1/users_controller.rb

  def sign_in
    patron = Patron.find_by_username(params[:username])
---
SELECT  "patrons".* FROM "patrons" WHERE "patrons"."username" = $1 LIMIT $2  [["username", "\"01-134151-050\","], ["LIMIT", 1]]

  def search_book
    if params[:keyword].present? && params[:search_by].present?
      search = params[:keyword]
      if params[:search_by] == "keyword"
        @books = Book.where("title LIKE ? OR sub_title LIKE ? OR author LIKE ? OR sub_author LIKE ? OR section LIKE ? OR book_publisher LIKE ? OR place LIKE ? OR book_source LIKE ? OR book_edition LIKE ? OR series LIKE ? OR isbn LIKE ? OR subject LIKE ? OR keyword LIKE ? OR discipline LIKE ?", "%#{search}%", "%#{search}%", "%#{search}%", "%#{search}%", "%#{search}%", "%#{search}%", "%#{search}%", "%#{search}%", "%#{search}%", "%#{search}%", "%#{search}%", "%#{search}%", "%#{search}%", "%#{search}%")
---
SELECT "books".* FROM "books" WHERE (title like '%The Little Foxe%' OR sub_title like '%The Little Foxe%' OR author like '%The Little Foxe%' OR sub_author like '%The Little Foxe%' OR section is '%The Little Foxe%' OR book_publisher like '%The Little Foxe%' place like '%The Little Foxe%' OR book_year like '%The Little Foxe%' OR book_source like '%The Little Foxe%' OR book_edition like '%The Little Foxe%' OR series is '%The Little Foxe%' OR isbn like '%The Little Foxe%' OR subject like '%The Little Foxe%' OR keyword is '%The Little Foxe%' OR discipline like '%The Little Foxe%')

  def reserve_book
    if params[:book_id].present? && params[:user_id].present?
      reserverd_book = ReserveBook.new(user_id: params[:user_id], book_id: params[:book_id], status: false)
      if reserverd_book.save
---
INSERT INTO "reserve_books" ("user_id", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["book_id", 50], ["created_at", "2018-04-07 20:07:26.480340"], ["updated_at", "2018-04-07 20:07:26.480340"]]

  def show_book
    if params[:book_id].present?
      book = Book.find_by_id(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]

  def books_list
    books = Book.all
---
SELECT "books".* FROM "books"

  def reserve_books
    books=ReserveBook.where(user_id: params[:user_id])
    if books.present?
---
SELECT "reserve_books".* FROM "reserve_books" WHERE "reserve_books"."user_id" = $1  [["user_id", 2]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def book_suggestion
    book_suggestion =BookSuggestion.new(book_suggestion_params)
    if book_suggestion.save
---
INSERT INTO "book_suggestions" ("book_name", "author_name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["book_name", "ABC"], ["author_name", "ali"], ["user_id", 2], ["created_at", "2018-04-17 18:41:56.933402"], ["updated_at", "2018-04-17 18:41:56.933402"]]